[
    {
        "title": "E-Waste Management Market Size",
        "publishedAt": "2023-09-16",
        "description": "E-Waste Management Market Size is projected to reach USD 189.8 billion by 2030, growing at a CAGR of 14.4%: Straits Research",
        "link": "https://www.globenewswire.com/news-release/2023/09/13/2742730/0/en/E-Waste-Management-Market-Size-is-projected-to-reach-USD-189-8-billion-by-2030-growing-at-a-CAGR-of-14-4-Straits-Research.html"
    },
    {
        "title": "PM takes up environment impact of e-waste disposal",
        "publishedAt": "2023-01-30",
        "description": "Only 15 to 17% of the e-waste generated every year is recycled, Prime Minister Narendra Modi said on Sunday drawing attention to consequences of mounting e-waste, dedicating a major portion of the 97th edition of his Mann ki Baat radio address to environmental issues.",
        "link": "https://www.hindustantimes.com/india-news/pm-takes-up-environment-impact-of-e-waste-disposal-101675015673757.html"
    },
    {
        "title": "Apple’s First Carbon Neutral Products Ignore the E-Waste Crisis",
        "publishedAt": "2023-09-15",
        "description": "Apple revealed its first carbon-neutral products on Tuesday, highlighting select Apple Watch and band pairings as the first step in a promised eco-friendly renaissance. The tech giant plans to make every one of its products carbon-neutral by 2030, but with every annual product cycle, the company ignores the ongoing e-waste crisis.",
        "link": "https://themessenger.com/tech/apples-first-carbon-neutral-products-e-waste-crisis-watch-series-9-ultra-2"
    },
    {
        "title": "E-waste re-cycling: How the new rules can solve India's large e-waste issue",
        "publishedAt": "2023-04-30",
        "description": "As India’s e-waste problem grows, with 1.1 million tonnes of e-waste generated in 2019-20—just after China and the US, the government has taken specific measures towards formalising the e-waste recycling space in the country. Replacing the E-Waste (Management) Rules, 2016—that made it compulsory for dismantling and recycling units to get authorisation from the concerned departments—are the E-Waste (Management) Rules, 2022, that kicked in from April 1, 2023.",
        "link": "https://www.businesstoday.in/magazine/the-buzz/story/e-waste-re-cycling-how-the-new-rules-can-solve-indias-large-e-waste-issue-377113-2023-04-12"
    },
    {
        "title": "Recycling has gone up in last 5 years, but 67% of e-waste remains unprocessed",
        "publishedAt": "2023-03-31",
        "description": "India recycled only 32.9 per cent of the e-waste generated in 2021-2022, data from the Ministry of Environment, Forest and Climate Change shows. While the figure has gone up from previous years, it indicates that a staggering 10,74,024 tonnes (67%) of e-waste remained unprocessed.",
        "link": "https://indianexpress.com/article/world/climate-change/recycling-gone-up-last-5-years-67-e-waste-remains-unprocessed-8530613/"
    },
    {
        "title": "Hindalco plans Rs 2,000 crore copper, e-waste recycling unit",
        "publishedAt": "2023-04-25",
        "description": "Hindalco will be playing a key role in India's emergence as a manufacturing powerhouse during the Amrit Kaal or the 25-year period leading to the 100th year of the country's independence, Kumar Mangalam Birla said.",
        "link": "https://www.moneycontrol.com/news/business/hindalco-to-invest-rs-2000-crore-for-first-ever-copper-and-e-waste-recycling-facility-km-birla-at-agm-11238701.html"
    },
    {
        "title": "Mayapur Clean & Green Successfully Addressing E-Waste Management",
        "publishedAt": "2023-09-02",
        "description": "Mayapur Clean & Green has expanded its service to address one of the most dangerous kinds of waste for one’s health and the environment: electronic or e-waste, including phones, computers, cables, earphones, refrigerators, batteries, AC units, and similar items.",
        "link": "https://iskconnews.org/mayapur-clean-green-successfully-addressing-e-waste-management/"
    },
    {
        "title": "From grassroots to government, Singapore takes lead in tackling e-waste",
        "publishedAt": "2023-08-14",
        "description": "SINGAPORE — If you didn’t know better, you might think Edwin Beng is heading home after buying a new appliance. It’s a muggy Sunday morning in Singapore, and Beng, carrying a signature bright blue Ikea bag in one hand, steps off the street, descends into a building basement, and enters a corner room....",
        "link": "https://news.mongabay.com/2023/08/from-grassroots-to-government-singapore-takes-lead-in-tackling-e-waste/"
    },
    {
        "title": "E-waste park to come up in Delhi, but many miles to go",
        "publishedAt": "2023-04-20",
        "description": "DSIIDC floated a tender for the park in February, which states that the facility should be run according to E-Waste (Management) Rules, 2016",
        "link": "https://www.hindustantimes.com/cities/delhi-news/delhis-electronic-waste-park-to-begin-construction-in-2025-as-tender-for-development-yet-to-be-awarded-informal-sector-still-handling-90-of-ewaste-101682013427696.html"
    },
    {
        "title": "How the e-waste you produce is providing poor children with a dangerous living",
        "publishedAt": "2023-02-10",
        "description": "Discarded laptops and smartphones contain valuable metals. However, extraction, usually performed by children, is a crude and hazardous process that goes unregulated.",
        "link": "https://indianexpress.com/article/explained/explained-health/how-the-e-waste-you-produce-is-providing-poor-children-with-a-dangerous-living-8435127/"
    },
    {
        "title": "Test Drive: How to dispose e-waste in Delhi",
        "publishedAt": "2023-04-24",
        "description": "The proper disposal of electronic waste (e-waste) is an issue that plagues Delhi. The Capital is estimated to generate around 200,000 tonne of e-waste per annum, but with no fixed mechanism for the safe and convenient disposal of this waste, around 90% of electronic products end up in landfills",
        "link": "https://www.hindustantimes.com/cities/delhi-news/how-to-dispose-e-waste-in-delhi-101682332508221.html"
    },
    {
        "title": "Today's latest devices like mobiles are future's e-waste: PM Modi",
        "publishedAt": "2023-01-29",
        "description": "NEW DELHI: PM Narendra Modi, in his Mann Ki Baat",
        "link": "https://timesofindia.indiatimes.com/india/todays-latest-devices-like-mobiles-are-futures-e-waste-pm-modi/articleshow/97422550.cms?from=mdr"
    },
    {
        "title": "How disposable tech is feeding an e-waste crisis",
        "publishedAt": "2022-11-21",
        "description": "Some 54 million metric tonnes of phones, computers and other so-called e-waste are produced a year, according to data from the United Nations Environment Programme (UNEP) and partners.That is equivalent to 7 kilogrammes for every person on Earth; a number predicted to double by 2050 if nothing is done.",
        "link": "https://www.unep.org/news-and-stories/story/how-disposable-tech-feeding-e-waste-crisis"
    },
    {
        "title": "Focus on E-Waste recycling, says PM Modi in Mann Ki Baat | Highlights",
        "publishedAt": "2023-01-29",
        "description": "In the previous episode of 'Mann Ki Baat,' which aired on December 25, PM Modi discussed how India is on track to become the world's fifth largest economy by 2022, having produced 220 crore vaccines and crossing the USD 400 billion mark in exports. He praised the government's 'Atmanirbhar Bharat' initiative and spoke about 'Amrit Kaal' as India celebrated its 75th anniversary of independence.",
        "link": "https://www.hindustantimes.com/india-news/pm-narendra-modi-mann-ki-baat-today-live-updates-pm-modi-addresses-first-episode-of-2023-101674965653864.html"
    },
    {
        "title": "e-waste rises by 9 lakh tonnes in 5 years, recyclers underutilised",
        "publishedAt": "2023-04-08",
        "description": "According to the Ministry of Environment, Forest and Climate Change, India’s e-waste generation figures rose from 7.08 lakh tonnes in 2017-18 to 16.01 lakh tonnes in 2021-22. According to the data, provided by the Central Pollution Control Board, India’s e-waste is witnessing an annual growth of nearly 20 per cent.",
        "link": "https://www.tribuneindia.com/news/nation/e-waste-rises-by-9-lakh-tonnes-in-5-years-recyclers-underutilised-495164"
    },
    {
        "title": "Door-to-door e-waste collection begins in Pune",
        "publishedAt": "2022-12-06",
        "description": "While the Maharashtra Pollution Control Board (MPCB) website states that a total 18,559.3 metric tonnes (MT) of e-waste was dismantled and recycled in the year 2021-22, the Central Pollution Control Board (CPCB) states that only 5% of the e-waste was collected. ",
        "link": "https://www.hindustantimes.com/cities/pune-news/doortodoor-e-waste-collection-begins-in-pune-101670349068483.html"
    },
    {
        "title": "What should you do with your electronic waste?",
        "publishedAt": "2023-08-15",
        "description": "Can you imagine having gold and throwing it away? Well, this happens more often than you might think. For example, with those electrical or electronic devices that stopped working or that we no longer use. These artifacts are generally made of plastics as well as metals such as aluminum, copper and, yes, gold.",
        "link": "https://english.elpais.com/science-tech/2023-08-20/what-should-you-do-with-your-electronic-waste.html"
    },
    {
        "title": "E-waste: Five billion phones to be thrown away in 2022",
        "publishedAt": "2022-10-14",
        "description": "This year, 5.3 billion mobile phones will be thrown away the international waste electrical and electronic equipment (WEEE) forum says.",
        "link": "https://www.bbc.com/news/science-environment-63245150"
    },
    {
        "title": "CBIC To Implement The E-Waste (Management) Rules, 2022 w.e.f. April 2023",
        "publishedAt": "2023-01-09",
        "description": "The Central Board of Indirect Taxes and Customs (CBIC) has issued instructions regarding the implementation of the E-Waste (Management) Rules, 2022.",
        "link": "https://www.livelaw.in/news-updates/cbic-implement-the-e-waste-management-rules-2022-218518"
    },
    {
        "title": "Rochester e-waste firm, employee plead guilty to environmental law violations",
        "publishedAt": "2023-07-14",
        "description": "A Rochester company and one of its corporate leaders have pleaded guilty in Wayne County Court for their roles in the illegal disposal of 800 tons of electronic waste back in 2016.",
        "link": "https://rbj.net/2023/09/14/e-waste-firms-employees-plead-guilty-to-environmental-law-violations/"
    },
    {
        "title": "Latest Global E-Waste Statistics And What They Tell Us",
        "publishedAt": "2023-04-16",
        "description": "A large proportion of EEE has a short life span, and is often perceived as being difficult or expensive to repair. Brands spend billions creating consumer demand for the latest models, leaving older technology obsolete and unwanted even when it remains serviceable.",
        "link": "https://theroundup.org/global-e-waste-statistics/"
    },
    {
        "title": "New York Recycling Companies Convicted for Illegal E-Waste Dumping",
        "publishedAt": "2023-07-15",
        "description": "The judgment against ALPCO Recycling and Finger Lakes Cleanup was handed down by the NYS Attorney General’s Office recently. Both companies pled guilty to the improper handling of 800 tons of electronic waste during the months of May to July in 2016.",
        "link": "https://www.waste360.com/e-waste/new-york-recycling-companies-convicted-illegal-e-waste-dumping"
    },
    {
        "title": "ERI building 3 ITAD and electronics recycling facilities to ‘recalibrate’ for new demand",
        "publishedAt": "2023-07-12",
        "description": "As more electronics enter the waste stream each year, ERI plans to open three new ITAD and electronics recycling centers in 2024 as part of its plan to “recalibrate” its footprint in the Southwest and accommodate demand, the company announced last week.",
        "link": "https://www.wastedive.com/news/eri-shegerian-ewaste-arizona-electronics-recycling/693567/"
    },
    {
        "title": "E-waste Disposal Market Size & Analysis Report 2023-2030",
        "publishedAt": "2023-07-11",
        "description": "Global E-waste Disposal Market 2023-2030 Adaptive Research Report covers a wide range of factors, including detailed information on Types, Applications [ICT Equipment, Home Appliances, Others], customer needs, wants, and expectations, as well as competitor analysis, E-waste Disposal market size, analyzing industry trends and growth potential.",
        "link": "https://www.benzinga.com/pressreleases/23/09/34607532/e-waste-disposal-market-size-analysis-report-2023-2030-124-pages-report"
    },
    {
        "title": "Experts warn of e-waste issues over iPhone charging port switch",
        "publishedAt": "2023-07-12",
        "description": "The technology giant is expected to unveil the latest iPhone 15 range on Tuesday evening, with the line-up widely reported to feature a USB-C port in place of Apple’s proprietary Lightning port for the first time.",
        "link": "https://www.independent.co.uk/business/experts-warn-of-ewaste-issues-over-iphone-charging-port-switch-b2409599.html"
    }
]